; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v6 ?v1)
             (pred_4 ?v4 ?v11)
             (pred_8 ?v6 ?v11)
             (pred_12 ?v2 ?v6 )
	     (pred_3 ?v6)
             (pred_6 ?v12)
             (pred_2 ?v4)
             (pred_7 ?v11)
             (pred_1 ?v6)
             (pred_11 ?v4)
             (pred_10 ?v6)
             (pred_9 ))



(:action op_2
:parameters (?v5 ?v7 ?v9 ?v8)
:precondition (and (pred_6 ?v5) (pred_6 ?v7) (pred_2 ?v9) (pred_7 ?v8)
          (pred_5 ?v5 ?v7) (pred_4 ?v9 ?v8)
                   (pred_8 ?v7 ?v8) (pred_3 ?v5) 
                   (pred_1 ?v7) (pred_11 ?v9))
:effect (and  (pred_10 ?v7) (not (pred_1 ?v7))))


(:action op_5
:parameters (?v5 ?v3)
:precondition (and (pred_6 ?v5) (pred_6 ?v3)
               (pred_3 ?v5) (pred_5 ?v5 ?v3) (pred_10 ?v3))
:effect (and (pred_3 ?v3) (not (pred_3 ?v5))))

(:action op_1
:parameters (?v5 ?v9)
:precondition (and (pred_6 ?v5) (pred_2 ?v9) 
                  (pred_3 ?v5) (pred_12 ?v9 ?v5) (pred_9 ))
:effect (and (pred_11 ?v9)
   (not (pred_12 ?v9 ?v5)) (not (pred_9 ))))


(:action op_3
:parameters (?v5 ?v10 ?v13)
:precondition (and (pred_6 ?v5) (pred_2 ?v10) (pred_2 ?v13)
                  (pred_3 ?v5) (pred_11 ?v13) (pred_12 ?v10 ?v5))
:effect (and (pred_11 ?v10) (pred_12 ?v13 ?v5)
        (not (pred_11 ?v13)) (not (pred_12 ?v10 ?v5))))

(:action op_4
:parameters (?v5 ?v9)
:precondition (and (pred_6 ?v5) (pred_2 ?v9) 
                  (pred_3 ?v5) (pred_11 ?v9))
:effect (and (pred_9 ) (pred_12 ?v9 ?v5) (not (pred_11 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_14 obj_04 obj_20 obj_01 obj_15 obj_07 obj_02 obj_13 obj_16 obj_10 obj_08 obj_05 obj_18 obj_11 obj_12
    obj_06 obj_17
    obj_09 obj_19
    )

    (:init
       (pred_9)

       (pred_6 obj_03)
       (pred_6 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_15)
       (pred_6 obj_07)
       (pred_6 obj_02)
       (pred_6 obj_13)
       (pred_6 obj_16)
       (pred_6 obj_10)
       (pred_6 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_18)
       (pred_6 obj_11)
       (pred_6 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_17)
       (pred_2 obj_09)
       (pred_2 obj_19)

       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_14)
       (pred_5 obj_14 obj_15)
       (pred_5 obj_14 obj_04)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_04 obj_07)
       (pred_5 obj_04 obj_20)
       (pred_5 obj_04 obj_14)
       (pred_5 obj_20 obj_02)
       (pred_5 obj_20 obj_04)
       (pred_5 obj_01 obj_13)
       (pred_5 obj_01 obj_15)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_15 obj_16)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_14)
       (pred_5 obj_15 obj_01)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_04)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_02 obj_08)
       (pred_5 obj_02 obj_20)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_13 obj_05)
       (pred_5 obj_13 obj_16)
       (pred_5 obj_13 obj_01)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_10)
       (pred_5 obj_16 obj_15)
       (pred_5 obj_16 obj_13)
       (pred_5 obj_10 obj_11)
       (pred_5 obj_10 obj_08)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_16)
       (pred_5 obj_08 obj_12)
       (pred_5 obj_08 obj_02)
       (pred_5 obj_08 obj_10)
       (pred_5 obj_05 obj_18)
       (pred_5 obj_05 obj_13)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_18 obj_05)
       (pred_5 obj_11 obj_12)
       (pred_5 obj_11 obj_10)
       (pred_5 obj_11 obj_18)
       (pred_5 obj_12 obj_08)
       (pred_5 obj_12 obj_11)
       (pred_1 obj_18)
       (pred_1 obj_14)
       (pred_8  obj_18 obj_06)
       (pred_8  obj_14 obj_17)
       (pred_10 obj_03)
       (pred_10 obj_04)
       (pred_10 obj_20)
       (pred_10 obj_01)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_02)
       (pred_10 obj_13)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_11)
       (pred_10 obj_12)

       (pred_4  obj_09 obj_06)
       (pred_4  obj_19 obj_17)
       (pred_12 obj_09 obj_20)
       (pred_12 obj_19 obj_01)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_12 obj_09 obj_04)
    ))
(:constraints
  (always (not (pred_3 obj_07)))
)
)

; plan
1. (op_5 obj_16 obj_10)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_10)
   goals met: 0 of 1
2. (op_5 obj_10 obj_08)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_02)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_02)
   goals met: 0 of 1
4. (op_5 obj_02 obj_20)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_20)
   goals met: 0 of 1
5. (op_1 obj_20 obj_09)
   deleted: (pred_12 obj_09 obj_20) (pred_9)
   added: (pred_11 obj_09)
   goals met: 0 of 1
6. (op_5 obj_20 obj_04)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_04)
   goals met: 0 of 1
7. (op_4 obj_04 obj_09)
   deleted: (pred_11 obj_09)
   added: (pred_9) (pred_12 obj_09 obj_04)
   goals met: 1 of 1
